# Core utilities
brew "coreutils"
brew "findutils"
brew "tree"

# Git
brew "git"
brew "git-delta"

# CLI tools
brew "fd"
brew "ripgrep"
brew "fzf"
brew "eza"
brew "bat"
brew "jq"
brew "vim"
brew "agent-browser"

# Password management
brew "pass"
brew "gnupg"
brew "pass-otp"

# Media
brew "ffmpeg"
brew "imagemagick"

# Development
brew "python@3.12"
brew "node@22"
brew "ruby"
brew "openjdk@17"

# Language servers
brew "texlab"
brew "marksman"
brew "yaml-language-server"
brew "pyright"

# Formatters
brew "black"

# Casks
cask "gpg-suite"
cask "mactex-no-gui"
